2018-04-08_20-07-58.535116/effective.yml
---
cli:
  linter:
    disable: false
    ignored-warnings: []
    lint-and-exit: false
    warn-on-unfamiliar-fields: false
cli-aliases:
  cloud:
    provisioning: cloud
  detach:
    modules:
      cloud:
        detach: true
  func:
    modules:
      console:
        disable: true
    settings:
      aggregator: functional-consolidator
  gui:
    modules:
      jmeter:
        gui: true
  install-tools:
    services:
    - install-checker
  lint:
    cli:
      linter:
        lint-and-exit: true
  local:
    provisioning: local
  locations:
    modules:
      cloud:
        dump-locations: true
    provisioning: cloud
  nolint:
    cli:
      linter:
        disable: true
  public:
    modules:
      blazemeter:
        public-report: true
  report:
    reporting:
    - blazemeter
  sequential:
    modules:
      local:
        sequential: true
execution:
  concurrency:
    local: 20
  hold-for: 1m
  ramp-up: 1m
  scenario: LT-Easytravel
  throughput:
    local: null
included-configs: []
install-id: a45e60ee260f
modules:
  ab:
    class: bzt.modules.ab.ApacheBenchmarkExecutor
  android-emulator:
    class: bzt.modules.services.AndroidEmulatorLoader
  apiritif:
    class: bzt.modules.python.ApiritifNoseExecutor
  appium:
    class: bzt.modules.services.AppiumLoader
  blazemeter:
    class: bzt.modules.blazemeter.BlazeMeterUploader
    token: '********'
  capturehar:
    class: bzt.modules.blazemeter.ServiceStubCaptureHAR
  cloud:
    class: bzt.modules.blazemeter.CloudProvisioning
    default-location: us-central1-a
  console:
    class: bzt.modules.console.ConsoleStatusReporter
  consolidator:
    class: bzt.modules.aggregator.ConsolidatingAggregator
    percentiles:
    - 0.0
    - 50.0
    - 90.0
    - 95.0
    - 99.0
    - 99.9
    - 100.0
  final-stats:
    class: bzt.modules.reporting.FinalStatus
  final_stats:
    class: bzt.modules.reporting.FinalStatus
  functional-consolidator:
    class: bzt.modules.functional.FunctionalAggregator
  gatling:
    class: bzt.modules.gatling.GatlingExecutor
    properties:
      gatling.data.file.bufferSize: 256
  grinder:
    class: bzt.modules.grinder.GrinderExecutor
    properties:
      grinder.useConsole: false
  install-checker:
    class: bzt.modules.services.InstallChecker
  jmeter:
    class: bzt.modules.jmeter.JMeterExecutor
    path: /Users/sergiomaurenzi/.bzt/jmeter-taurus/4.0/bin/jmeter.sh
    plugins:
    - jpgc-casutg
    - jpgc-dummy
    - jpgc-ffw
    - jpgc-fifo
    - jpgc-functions
    - jpgc-json
    - jpgc-perfmon
    - jpgc-prmctl
    - jpgc-tst
    properties:
      jmeter.save.saveservice.autoflush: 'true'
      jmeter.save.saveservice.connect_time: 'true'
      jmeterengine.force.system.exit: 'true'
      summariser.name: ''
    system-properties:
      sun.net.inetaddr.ttl: 0
    version: '4.0'
  junit:
    class: bzt.modules.java.JUnitTester
  junit-xml:
    class: bzt.modules.reporting.JUnitXMLReporter
  local:
    class: bzt.modules.provisioning.Local
  locust:
    class: bzt.modules.locustio.LocustIOExecutor
  mocha:
    class: bzt.modules.javascript.MochaTester
  molotov:
    class: bzt.modules.molotov.MolotovExecutor
  monitoring:
    class: bzt.modules.monitoring.Monitoring
  newman:
    class: bzt.modules.javascript.NewmanExecutor
  nose:
    class: bzt.modules.python.ApiritifNoseExecutor
  nunit:
    class: bzt.modules.csharp.NUnitExecutor
  passfail:
    class: bzt.modules.passfail.PassFailStatus
  pbench:
    class: bzt.modules.pbench.PBenchExecutor
  proxy2jmx:
    class: bzt.modules.proxy2jmx.Proxy2JMX
  pytest:
    class: bzt.modules.python.PyTestExecutor
  robot:
    class: bzt.modules.python.RobotExecutor
  rspec:
    class: bzt.modules.ruby.RSpecTester
  screenshoter:
    class: bzt.modules.blazemeter.ServiceStubScreenshoter
  selenium:
    class: bzt.modules.selenium.SeleniumExecutor
  shellexec:
    class: bzt.modules.shellexec.ShellExecutor
  siege:
    class: bzt.modules.siege.SiegeExecutor
  testng:
    class: bzt.modules.java.TestNGTester
  tsung:
    class: bzt.modules.tsung.TsungExecutor
  unpacker:
    class: bzt.modules.services.Unpacker
  virtual-display:
    class: bzt.modules.services.VirtualDisplay
  wdio:
    class: bzt.modules.javascript.WebdriverIOExecutor
provisioning: local
reporting:
- module: final-stats
- module: console
- data-source: pass-fail
  filename: /var/lib/jenkins/workspace/Taurus-Jenkins-ServiceNow-Demo/junit-report.xml
  module: junit-xml
- module: blazemeter
  project: Default
  report-name: Easytravel-LoadTest-Demo
  test: Test-Easytravel.yml
scenarios:
  LT-Easytravel:
    headers: null
    requests:
    - headers:
        Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8
        Upgrade-Insecure-Requests: '1'
      label: http://ec2-54-210-22-3.compute-1.amazonaws.com:8079/
      method: GET
      think-time: 0ms
      url: http://ec2-54-210-22-3.compute-1.amazonaws.com:8079/
    - body:
        info: '1'
        journey_id: '11'
      headers:
        Accept: application/json, text/javascript, */*; q=0.01
        Content-Type: application/x-www-form-urlencoded; charset=UTF-8
        Origin: http://ec2-54-210-22-3.compute-1.amazonaws.com:8079
        Referer: http://ec2-54-210-22-3.compute-1.amazonaws.com:8079/
        X-Requested-With: XMLHttpRequest
      label: http://ec2-54-210-22-3.compute-1.amazonaws.com:8079/rating/ratings.php
      method: POST
      url: http://ec2-54-210-22-3.compute-1.amazonaws.com:8079/rating/ratings.php
    - body:
        info: '1'
        journey_id: '11'
      headers:
        Accept: application/json, text/javascript, */*; q=0.01
        Content-Type: application/x-www-form-urlencoded; charset=UTF-8
        Origin: http://ec2-54-210-22-3.compute-1.amazonaws.com:8079
        Referer: http://ec2-54-210-22-3.compute-1.amazonaws.com:8079/
        X-Requested-With: XMLHttpRequest
      label: http://ec2-54-210-22-3.compute-1.amazonaws.com:8079/rating/ratings.php
      method: POST
      url: http://ec2-54-210-22-3.compute-1.amazonaws.com:8079/rating/ratings.php
    - body:
        _: '1523225235535'
      headers:
        Accept: text/html, */*; q=0.01
        Content-Type: application/x-www-form-urlencoded; charset=UTF-8
        Referer: http://ec2-54-210-22-3.compute-1.amazonaws.com:8079/
        X-Requested-With: XMLHttpRequest
      label: http://ec2-54-210-22-3.compute-1.amazonaws.com:8079/CalculateRecommendations
      method: GET
      url: http://ec2-54-210-22-3.compute-1.amazonaws.com:8079/CalculateRecommendations
    - headers:
        Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8
        Referer: http://ec2-54-210-22-3.compute-1.amazonaws.com:8079/
        Upgrade-Insecure-Requests: '1'
      label: http://ec2-54-210-22-3.compute-1.amazonaws.com:8079/amp/
      method: GET
      think-time: 1608ms
      url: http://ec2-54-210-22-3.compute-1.amazonaws.com:8079/amp/
    - headers:
        Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8
        Referer: http://ec2-54-210-22-3.compute-1.amazonaws.com:8079/amp/
        Upgrade-Insecure-Requests: '1'
      label: http://ec2-54-210-22-3.compute-1.amazonaws.com:8079/amp/italy/
      method: GET
      think-time: 4395ms
      url: http://ec2-54-210-22-3.compute-1.amazonaws.com:8079/amp/italy/
services:
- local:
  - metrics:
    - cpu
    - mem
    - bytes-sent
    - bytes-recv
    - disk-read
    - disk-write
    - disk-space
    - engine-loop
    - conn-all
  module: monitoring
- criteria:
  - condition: '>'
    fail: true
    label: ''
    logic: for
    message: null
    stop: true
    subject: avg-rt
    threshold: 50ms
    timeframe: 10s
  - condition: '>'
    fail: true
    label: 'reserve '
    logic: for
    message: null
    stop: false
    subject: hits
    threshold: '100'
    timeframe: 10s
  module: passfail
settings:
  aggregator: consolidator
  default-executor: jmeter
  env:
    OBJC_DISABLE_INITIALIZE_FORK_SAFETY: 'YES'
version: 1.11.0